Repository: Boipisigre/flask-multi-langage
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: eo, fr

source: E-mail address
eo: retadreso
fr: Adresse courriel

source: Flask Multi Language
eo: Flask multaj Lingvoj
fr: Babel gestion des langues

source: user@example.com
eo: uzanto@eksemplo.com
fr: utilisateur@exemple.com

source: Hello world!
eo: Saluton mondo
fr: Bonjour le monde

source: Lets all be unique together until we realise we are all the same.
eo: Ni ĉiuj estu unikaj kune ĝis ni konscios, ke ni ĉiuj estas samaj.
fr: Soyons tous uniques ensemble jusqu'à ce que nous réalisions que nous sommes tous les mêmes.

source: Two more days and all his problems would be solved.
eo: Du pliajn tagojn kaj ĉiuj liaj problemoj estus solvitaj.
fr: Deux jours de plus et tous ses problèmes seraient résolus.

source: Excitement replaced fear until the final moment.
eo: Ekscitiĝo anstataŭigis timon ĝis la lasta momento.
fr: L'excitation a remplacé la peur jusqu'au dernier moment.

source: we replaced fear until the begin moment.
eo: ni anstataŭigis la timon ĝis la momento de la foriro.
fr: nous avons remplacé la peur jusqu'au moment de départ.

source: Malls are great places to shop; I can find everything I need under one roof.
eo: Butikcentroj estas bonegaj lokoj por butikumi; Mi povas trovi ĉion, kion mi bezonas sub unu tegmento.
fr: Les centres commerciaux sont des endroits formidables pour faire du shopping ; je peux trouver tout ce dont j'ai besoin sous un toit.

source: un test de texte en français.
eo: franca tekstotesto

source: Bye!
eo: Ĝis la revido
fr: Au revoir
